---
type: Definition
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# Definition

`Autodesk.Revit.DB.Definition` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetDataType | 2022 | `public ForgeTypeId GetDataType ()` |
| Method | GetGroupTypeId | — | `public abstract ForgeTypeId GetGroupTypeId ()` |
| Property | Name | — | `public abstract string Name { get ; }` |
| Property | ParameterGroup | — | `[ ObsoleteAttribute ("This property is deprecated in Revit 2024 and may be removed in a future version of Revit. Please use the `GetGroupTypeId()` method instead.")] public abstract BuiltInParameterGroup ParameterGroup {` |